#   -*- mode: org; fill-column: 65 -*-

#+TITLE: List of Org-mode user-visible changes
#+AUTHOR:  Carsten Dominik
#+EMAIL:  carsten at orgmode dot org
#+LANGUAGE:  en
#+STARTUP: indent hidestars
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t author:nil <:t LaTeX:t
#+KEYWORDS:  Org Emacs outline planning note authoring project plain-text LaTeX HTML
#+DESCRIPTION: Org: an Emacs Mode for Notes, Planning, and Authoring
#+STYLE:     <base href="http://orgmode.org/" />
#+STYLE:     <link rel="stylesheet" href="http://orgmode.org/org.css" type="text/css" />

*** Code block variable initialized with Emacs Lisp code in tables and lists

It is no longer possible to assign code block variables using
executable Emacs Lisp statements contained in tables or lists.
As per the following example.
#+tblname: table
| (a b c) |

#+begin_src perl :var data=table[0,0]
  $data
#+end_src

#+results:
: (a b c)

Thanks to Vladimir Alexiev for raising this issue.

**** Calc code blocks can now accept vectors
For example;

#+begin_src calc :var y=[1 2 3]
  3 y
#+end_src

#+results:
: [3, 6, 9]

Thanks to Eric S. Fraga for raising this issue

